avnet-iotconnect/avnet-iotc-mtb-psoc-edge-aivision-webrtc/proj_cm33_ns/webrtc/algorithm/signaling.c
// transport_error bumps to non-zero whenever the wslay recv/send callback
// observes a hard error on the underlying socket. signaling_wait_for_offer
// treats this as fatal; everything else (timeout, no message yet) is "keep
// polling".
//
// SDP offer plumbing: KVS bursts several frames (often ICE_CANDIDATE *and*
// SDP_OFFER) inside one wslay_event_recv call, firing on_msg_recv for each.
// dispatch_text_frame captures every SDP_OFFER into an internally-owned
// pending slot regardless of whether a wait_for_offer is currently parked —
// the WSS stays open across many viewer sessions, so a browser START arriving
// while we're in the middle of tearing down the previous viewer must not be
// dropped. signaling_wait_for_offer drains the pending slot immediately if
// one is present, otherwise blocks until the next offer arrives.
// Cross-task handoff for outbound WSS messages. Producer (the task that
// calls signaling_send_*) builds the full envelope on the heap, then drops
// {envelope, len} into outbox_queue and returns immediately. Consumer
// (signaling_tick on the webrtc task) is the sole owner of wslay state: it
// drains the queue, hands each envelope to wslay_event_queue_msg (which
// copies the bytes internally), then free()s the envelope. This eliminates
// the producer-side wait on TLS-write that the previous shared-mutex design
// suffered from — see "synchronous-drain wart" in PILOT.md §69.
typedef struct SignalingOutboxItem {
    uint8_t *envelope;
    size_t   len;
} SignalingOutboxItem_t;

struct SignalingCtx {
    NetworkContext_t net_ctx;
    wslay_event_context_ptr ws_ctx;
    SemaphoreHandle_t ws_mutex;
    QueueHandle_t outbox_queue;
    bool connected;
    bool transport_error;
    // Latest SDP offer captured from the WSS. Owned by signaling; malloc'd in
    // dispatch_text_frame when an SDP_OFFER arrives, freed when
    // signaling_wait_for_offer consumes it (or on disconnect). A second offer
    // arriving before the first is consumed replaces it — newest wins, which
    // matches what a viewer doing STOP/START expects.
    char *pending_offer_sdp;
    size_t pending_offer_len;
    // senderClientId of the viewer that sent the pending offer. Consumed by
    // signaling_send_answer to fill RecipientClientId. Re-latched on every
    // incoming SDP_OFFER so back-to-back viewers route correctly.
    char peer_client_id[SIG_CLIENT_ID_MAX];
    size_t peer_client_id_len;
    PeerConnectionSession_t *peer_connection_session;
    // Last time we queued a WSS PING. See SIG_KEEPALIVE_PING_INTERVAL_MS.
    TickType_t last_ping_tick;
};

// File-scope statics for predictable-size scratch used inside
// signaling_resolve_endpoint. One call at a time (single WebRTC task).
static char s_url_buf[SIG_URL_BUF];
static char s_body_buf[SIG_BODY_BUF];
// SigV4_GenerateHTTPAuthorization treats authBufLen as in/out: input is capacity,
// output is bytes actually written (always <= capacity). We pass SIG_AUTH_BUF in,
// then null-terminate at the returned length — the +1 byte covers the case where
// SigV4 fills the buffer completely and we still need somewhere for the '\0'.
static char s_auth_buf[SIG_AUTH_BUF + 1];
static mbedtls_sha256_context s_sha_ctx;
static struct SignalingCtx g_sig;

// -------------------------------------------------------------------------
// mbedTLS SHA-256 callbacks (same pattern as webrtc_smoke_test.c)
// -------------------------------------------------------------------------

static int32_t sha256_init_cb(void *ctx) {
    mbedtls_sha256_init((mbedtls_sha256_context *) ctx);
    return mbedtls_sha256_starts((mbedtls_sha256_context *) ctx, 0);
}

static int32_t sha256_update_cb(void *ctx, const uint8_t *in, size_t len) {
    return mbedtls_sha256_update((mbedtls_sha256_context *) ctx, in, len);
}

static int32_t sha256_final_cb(void *ctx, uint8_t *out, size_t outlen) {
    (void) outlen;
    return mbedtls_sha256_finish((mbedtls_sha256_context *) ctx, out);
}


// -------------------------------------------------------------------------
// Helpers
// -------------------------------------------------------------------------

// Format the current UTC time as ISO 8601 for SigV4 ("YYYYMMDDTHHMMSSz").
// Writes exactly 16 chars + null terminator into buf[SIG_DATE_ISO_LEN].
static void format_iso8601_now(char buf[SIG_DATE_ISO_LEN]) {
    time_t now = time(NULL);
    struct tm t;
    gmtime_r(&now, &t);
    strftime(buf, SIG_DATE_ISO_LEN, "%Y%m%dT%H%M%SZ", &t);
}

int signaling_resolve_endpoint(const AwsCreds *creds, char *out_endpoint, size_t cap) {
    if (NULL == creds || NULL == out_endpoint || 0 == cap) {
        return -1;
    }

    // 1. Build URL + body via the Signaling library.
    SignalingAwsRegion_t region = {
        .pAwsRegion      = creds->region,
        .awsRegionLength = strlen(creds->region),
    };
    GetSignalingChannelEndpointRequestInfo_t req_info = {
        .channelArn = {
            .pChannelArn      = creds->channel_arn,
            .channelArnLength = strlen(creds->channel_arn),
        },
        .protocols = SIGNALING_PROTOCOL_WEBSOCKET_SECURE,
        // We're the on-channel endpoint, sitting and waiting for browsers
        // (KVS "viewers") to publish offers. The role names describe the
        // signaling-channel topology, not the media direction — a camera
        // streaming video out is still the MASTER. See PILOT.md §3.1
        // 2026-05-06 entry for the full breakdown.
        .role      = SIGNALING_ROLE_MASTER,
    };
    SignalingRequest_t sig_req = {
        .pUrl       = s_url_buf,
        .urlLength  = sizeof(s_url_buf),
        .pBody      = s_body_buf,
        .bodyLength = sizeof(s_body_buf),
    };

    SignalingResult_t sig_rc = Signaling_ConstructGetSignalingChannelEndpointRequest(
        &region, &req_info, &sig_req
    );
    if (SIGNALING_RESULT_OK != sig_rc) {
        printf("[signaling] ConstructGetSignalingChannelEndpointRequest failed: %d\n", (int) sig_rc);
        return -1;
    }
    // urlLength and bodyLength are now the actual written lengths (no null).
    // s_url_buf and s_body_buf are null-terminated by snprintf inside the lib.

    // 2. Parse host and resource path from the URL via the DRA URL module.
    //    IotclDraUrlContext malloc's the hostname and a copy of the URL.
    //    Zero-initialise so deinit is safe even if init fails.
    IotclDraUrlContext url_ctx = {0};
    if (0 != iotcl_dra_url_init(&url_ctx, s_url_buf)) {
        printf("[signaling] failed to parse URL from signaling lib: %s\n", s_url_buf);
        return -1;
    }
    const char *host = iotcl_dra_url_get_hostname(&url_ctx);
    const char *path = iotcl_dra_url_get_resource(&url_ctx);
    if (NULL == host || NULL == path) {
        printf("[signaling] URL missing host or path: %s\n", s_url_buf);
        iotcl_dra_url_deinit(&url_ctx);
        return -1;
    }

