avnet-iotconnect/avnet-iotc-mtb-psoc-edge-aivision-webrtc/proj_cm33_ns/webrtc/algorithm/signaling.c
    int rc = 0;
    char *canon_hdr_buf = NULL;
    IotConnectHttpResponse response = { 0 };

    // 3. Format current UTC time as ISO 8601.
    char date_iso[SIG_DATE_ISO_LEN];
    format_iso8601_now(date_iso);

    // 4. Build canonical headers string for SigV4 signing.
    //    Canonical form: "<name>:<value>\n" sorted lexicographically.
    //    We sign: host, x-amz-date, x-amz-security-token (sorted order).
    //    session_token varies (~1200 chars for STS tokens) — malloc to exact fit.
    size_t canon_hdr_size = strlen(host) + sizeof(date_iso) + strlen(creds->session_token) + SIG_CANON_HDR_OVERHEAD;
    canon_hdr_buf = malloc(canon_hdr_size);
    if (NULL == canon_hdr_buf) {
        printf("[signaling] OOM for canon_hdr_buf (%d bytes)\n", (int) canon_hdr_size);
        rc = -1;
        goto cleanup;
    }
    int hdr_len = snprintf(
        canon_hdr_buf, canon_hdr_size,
        "host:%s\n"
        "x-amz-date:%s\n"
        "x-amz-security-token:%s\n",
        host, date_iso, creds->session_token
    );
    if (hdr_len <= 0 || (size_t) hdr_len >= canon_hdr_size) {
        printf("[signaling] canon_hdr_buf overflow — SIG_CANON_HDR_OVERHEAD too small\n");
        rc = -1;
        goto cleanup;
    }

    // 5. Sign with SigV4.
    SigV4CryptoInterface_t crypto = {
        .hashInit      = sha256_init_cb,
        .hashUpdate    = sha256_update_cb,
        .hashFinal     = sha256_final_cb,
        .pHashContext  = &s_sha_ctx,
        .hashBlockLen  = 64,
        .hashDigestLen = 32,
    };
    SigV4Credentials_t sigv4_creds = {
        .pAccessKeyId       = creds->access_key_id,
        .accessKeyIdLen     = strlen(creds->access_key_id),
        .pSecretAccessKey   = creds->secret_access_key,
        .secretAccessKeyLen = strlen(creds->secret_access_key),
    };
    SigV4HttpParameters_t http_params = {
        .pHttpMethod   = "POST",
        .httpMethodLen = 4,
        .flags         = SIGV4_HTTP_PATH_IS_CANONICAL_FLAG
                       | SIGV4_HTTP_HEADERS_ARE_CANONICAL_FLAG,
        .pPath    = path,
        .pathLen  = strlen(path),
        .pQuery   = NULL,
        .queryLen = 0,
        .pHeaders   = canon_hdr_buf,
        .headersLen = (size_t) hdr_len,
        .pPayload   = s_body_buf,
        .payloadLen = sig_req.bodyLength,
    };
    SigV4Parameters_t sigv4_params = {
        .pCredentials     = &sigv4_creds,
        .pDateIso8601     = date_iso,
        .pAlgorithm       = NULL, // defaults to AWS4-HMAC-SHA256
        .algorithmLen     = 0,
        .pRegion          = creds->region,
        .regionLen        = strlen(creds->region),
        .pService         = KVS_SERVICE,
        .serviceLen       = KVS_SERVICE_LEN,
        .pCryptoInterface = &crypto,
        .pHttpParameters  = &http_params,
    };

    size_t auth_buf_len = SIG_AUTH_BUF; // reserve the +1 byte for null terminator
    char *sig_ptr = NULL;
    size_t sig_len = 0;
    SigV4Status_t sv4_rc = SigV4_GenerateHTTPAuthorization(
        &sigv4_params, s_auth_buf, &auth_buf_len, &sig_ptr, &sig_len
    );
    if (SigV4Success != sv4_rc) {
        printf("[signaling] SigV4_GenerateHTTPAuthorization failed: %d\n", (int) sv4_rc);
        rc = -1;
        goto cleanup;
    }
    s_auth_buf[auth_buf_len] = '\0';

    // 6. POST via iotc_http_client with Authorization + date + security-token headers.
    IotConnectHttpHeader extra_headers[3] = {
        { .name = "Authorization",        .value = s_auth_buf },
        { .name = "x-amz-date",           .value = date_iso   },
        { .name = "x-amz-security-token", .value = (char *) creds->session_token },
    };
    IotConnectHttpOpts opts = {
        .ca_cert     = (char *) IOTCL_AMAZON_ROOT_CA1,
        .cert        = NULL,
        .key         = NULL,
        .headers     = extra_headers,
        .headers_len = 3,
    };

    unsigned int http_rc = iotconnect_https_request_with_opts(
        &response, host, path, s_body_buf, &opts
    );
    if (0 != http_rc || NULL == response.data) {
        printf("[signaling] GetSignalingChannelEndpoint HTTP failed: 0x%08x\n", http_rc);
        rc = -1;
        goto cleanup;
    }

    // 7. Parse the response to extract the WSS endpoint.
    SignalingChannelEndpoints_t endpoints = { 0 };
    sig_rc = Signaling_ParseGetSignalingChannelEndpointResponse(
        response.data, strlen(response.data), &endpoints
    );
    if (SIGNALING_RESULT_OK != sig_rc) {
        printf("[signaling] ParseGetSignalingChannelEndpointResponse failed: %d\n", (int) sig_rc);
        rc = -1;
        goto cleanup;
    }
    if (NULL == endpoints.wssEndpoint.pEndpoint || 0 == endpoints.wssEndpoint.endpointLength) {
        printf("[signaling] no WSS endpoint in response\n");
        rc = -1;
        goto cleanup;
    }
    // The endpoint pointer is into response.data — copy before freeing.
    if (endpoints.wssEndpoint.endpointLength >= cap) {
        printf("[signaling] WSS endpoint too long for caller buffer (%d >= %d)\n",
            (int) endpoints.wssEndpoint.endpointLength, (int) cap);
        rc = -1;
        goto cleanup;
    }
    memcpy(out_endpoint, endpoints.wssEndpoint.pEndpoint, endpoints.wssEndpoint.endpointLength);
    out_endpoint[endpoints.wssEndpoint.endpointLength] = '\0';
    printf("[signaling] WSS endpoint: %s\n", out_endpoint);

cleanup:
    iotcl_dra_url_deinit(&url_ctx);
    free(canon_hdr_buf);
    iotconnect_free_https_response(&response);
    return rc;
}

// -------------------------------------------------------------------------
// Step 5b — build SigV4-presigned ConnectAsMaster URL
// -------------------------------------------------------------------------

// Append a literal string fragment to a write cursor, advancing it. Returns 0
// on success, -1 if the fragment doesn't fit (including no room for the '\0'
// we'll write later — caller controls termination).
static int append_literal(char **cur, size_t *remain, const char *s) {
    size_t n = strlen(s);
    if (n >= *remain) {
        return -1;
    }
    memcpy(*cur, s, n);
    *cur += n;
    *remain -= n;
    return 0;
}

