avnet-iotconnect/avnet-iotc-mtb-psoc-edge-aivision-webrtc/proj_cm33_ns/webrtc/algorithm/signaling.c
    printf("[signaling] presigned master URL ready (%d bytes)\n", (int)(prefix_len + query_len));
    return 0;

buf_too_small:
    printf("[signaling] presigned URL buffer too small (cap=%d)\n", (int) cap);
    return -1;
enc_fail:
    printf("[signaling] URI-encoding failed building presigned URL\n");
    return -1;
}

// -------------------------------------------------------------------------
// Step 5b — WSS handshake (HTTP/1.1 Upgrade)
// -------------------------------------------------------------------------
//
// We hand-roll the upgrade request and response parse rather than dragging in
// coreHTTP. The wire shape is small and well-defined; see RFC 6455 §1.3 / §4.
// After the 101 response is verified, the next session hands the still-open
// NetworkContext_t to wslay for frame I/O.
//
// Today's signaling_connect() opens the TLS connection, runs the upgrade,
// verifies Sec-WebSocket-Accept, then tears down. This proves the transport
// path end-to-end ahead of wiring wslay.


static void drain_outbox_locked(SignalingHandle sig);
static void maybe_queue_keepalive_ping_locked(SignalingHandle sig);

// Convert real CR/LF byte pairs in `in` to the 4-char JSON-escape form
// `\r\n` (backslash, 'r', backslash, 'n') and copy into `out`.
//
// Why: upstream's SDP serializer wraps the answer as
// `{"type":"answer","sdp":"<sdp body with literal \r\n bytes>"}`. That's
// invalid JSON — strings can't contain raw control characters per RFC 8259.
// The browser-side JSON.parse throws SyntaxError before the message reaches
// the WebRTC API. Ameba's reference calls
// `SignalingController_SerializeSdpContentNewline` for the same reason;
// this is the inlined equivalent. Must be called BEFORE base64 / WSS
// envelope construction. The matching DeserializeSdpContentNewline isn't
// needed on the receive path because our SDP parser tolerates either form
// (verified — offer parsing works today).
//
// Output is up to ~2x input on lines that are pure CRLF; in practice
// (one CRLF per ~30-byte SDP line) growth is ~7%. Caller passes the
// buffer capacity in *out_len; on success *out_len is set to bytes written.
// Returns 0 on success, -1 on overflow.
static int escape_sdp_newlines(const char *in, size_t in_len,
                               char *out, size_t *out_len) {
    size_t i = 0;
    size_t o = 0;
    size_t cap = *out_len;
    while (i < in_len) {
        if (in[i] == '\r' && i + 1 < in_len && in[i + 1] == '\n') {
            if (o + 4 > cap) {
                return -1;
            }
            out[o++] = '\\';
            out[o++] = 'r';
            out[o++] = '\\';
            out[o++] = 'n';
            i += 2;
        } else if (in[i] == '\n') {
            if (o + 4 > cap) {
                return -1;
            }
            // Lone LF (no preceding CR) — emit as \r\n anyway for
            // consistency; browsers tolerate either inside JSON.
            out[o++] = '\\';
            out[o++] = 'r';
            out[o++] = '\\';
            out[o++] = 'n';
            i += 1;
        } else {
            if (o + 1 > cap) {
                return -1;
            }
            out[o++] = in[i++];
        }
    }
    *out_len = o;
    return 0;
}

static int signaling_lock(SignalingHandle sig, TickType_t wait_ticks) {
    if (NULL == sig || NULL == sig->ws_mutex) {
        return -1;
    }

    if (pdTRUE != xSemaphoreTake(sig->ws_mutex, wait_ticks)) {
        printf("[signaling] ws mutex timeout\n");
        return -1;
    }

    return 0;
}


static void signaling_unlock(SignalingHandle sig) {
    if (NULL != sig && NULL != sig->ws_mutex) {
        xSemaphoreGive(sig->ws_mutex);
    }
}


void signaling_set_peer_connection(SignalingHandle sig, PeerConnectionSession_t *session) {
    if (NULL == sig) {
        return;
    }

    if (NULL != sig->ws_mutex) {
        if (0 != signaling_lock(sig, portMAX_DELAY)) {
            return;
        }
    }

    sig->peer_connection_session = session;

    if (NULL != sig->ws_mutex) {
        signaling_unlock(sig);
    }
}

// Split a "wss://<host>/<path-and-query>" URL into a malloc'd host and a
// path pointer (into the original buffer, after the host). On success the
// caller must free *out_host. Returns 0 on success, -1 on malformed URL.
static int wss_url_split(const char *url, char **out_host, const char **out_path) {
    if (0 != strncmp(url, "wss://", 6)) {
        printf("[signaling] not a wss:// URL\n");
        return -1;
    }
    const char *host_start = url + 6;
    const char *path_start = strchr(host_start, '/');
    if (NULL == path_start) {
        printf("[signaling] wss URL missing path\n");
        return -1;
    }
    size_t host_len = (size_t)(path_start - host_start);
    if (0 == host_len) {
        printf("[signaling] wss URL has empty host\n");
        return -1;
    }
    char *host = malloc(host_len + 1);
    if (NULL == host) {
        return -1;
    }
    memcpy(host, host_start, host_len);
    host[host_len] = '\0';
    *out_host = host;
    *out_path = path_start;
    return 0;
}

// Compute the expected Sec-WebSocket-Accept value: base64(SHA1(client_key + GUID)).
// out must be at least WSS_ACCEPT_B64_LEN. Returns 0 on success.
static int wss_compute_accept(const char *client_key_b64, char *out, size_t out_size) {
    unsigned char concat[WSS_NONCE_B64_LEN - 1 + sizeof(WSS_RFC6455_GUID) - 1];
    size_t key_len = strlen(client_key_b64);
    if (key_len + sizeof(WSS_RFC6455_GUID) - 1 > sizeof(concat)) {
        return -1;
    }
    memcpy(concat, client_key_b64, key_len);
    memcpy(concat + key_len, WSS_RFC6455_GUID, sizeof(WSS_RFC6455_GUID) - 1);

    unsigned char sha1[20];
    if (0 != mbedtls_sha1(concat, key_len + sizeof(WSS_RFC6455_GUID) - 1, sha1)) {
        return -1;
    }
    size_t out_len = 0;
    if (0 != mbedtls_base64_encode((unsigned char *) out, out_size, &out_len, sha1, sizeof(sha1))) {
        return -1;
    }
    return 0;
}

// Read response head into resp_buf until "\r\n\r\n" or buffer full / wall-clock
// budget exceeded. The socket recv timeout is short (so the steady-state event
// loop can poll), so the handshake has to gather across multiple zero-returns.
// Returns the number of bytes read on success, -1 on error. The buffer is NOT
// null-terminated by this function; caller does that using the returned length.
static int wss_recv_head(NetworkContext_t *net, uint8_t *resp_buf, size_t resp_cap) {
    size_t total = 0;
    TickType_t start = xTaskGetTickCount();
    const TickType_t budget = pdMS_TO_TICKS(WSS_HANDSHAKE_BUDGET_MS);

    while (total < resp_cap) {
        if ((xTaskGetTickCount() - start) >= budget) {
            printf("[signaling] WSS upgrade recv timeout (budget %u ms)\n",
                   (unsigned) WSS_HANDSHAKE_BUDGET_MS);
            return -1;
        }
        int32_t n = cy_awsport_network_receive(net, resp_buf + total, resp_cap - total);
        if (n < 0) {
            printf("[signaling] cy_awsport_network_receive failed: %d\n", (int) n);
            return -1;
        }
        if (0 == n) {
            // Per-call timeout — keep polling until the wall-clock budget runs out.
            continue;
        }
        total += (size_t) n;
        if (total >= 4) {
            for (size_t i = 0; i + 3 < total; i++) {
                if (resp_buf[i]   == '\r' && resp_buf[i+1] == '\n'
                 && resp_buf[i+2] == '\r' && resp_buf[i+3] == '\n') {
                    return (int) total;
                }
            }
        }
    }
    printf("[signaling] WSS upgrade response head exceeded %d bytes\n", (int) resp_cap);
    return -1;
}

// Find a header line "<name>:" in the response (case-insensitive) and return a
// pointer to the value (skipping the colon and any leading whitespace), with
// *out_value_len set to the value length up to the line's CRLF. Returns NULL
// if not found. resp must point at the start of headers (after status line).
static const char *wss_find_header(const char *resp, size_t resp_len, const char *name, size_t *out_value_len) {
    size_t name_len = strlen(name);
    for (size_t i = 0; i + name_len < resp_len; ) {
        // Match "<name>:" case-insensitively at start of line.
        bool match = true;
        for (size_t j = 0; j < name_len; j++) {
            char a = resp[i + j];
            char b = name[j];
            // ASCII tolower
            if (a >= 'A' && a <= 'Z') a = (char)(a - 'A' + 'a');
            if (b >= 'A' && b <= 'Z') b = (char)(b - 'A' + 'a');
            if (a != b) { match = false; break; }
        }
        if (match && i + name_len < resp_len && resp[i + name_len] == ':') {
            // Skip colon + LWS.
            size_t v = i + name_len + 1;
            while (v < resp_len && (resp[v] == ' ' || resp[v] == '\t')) v++;
            // Find CRLF.
            size_t e = v;
            while (e + 1 < resp_len && !(resp[e] == '\r' && resp[e+1] == '\n')) e++;
            *out_value_len = e - v;
            return resp + v;
        }
        // Advance to next line.
        while (i + 1 < resp_len && !(resp[i] == '\r' && resp[i+1] == '\n')) i++;
        i += 2;
    }
    return NULL;
}

// -------------------------------------------------------------------------
// wslay event callbacks
// -------------------------------------------------------------------------
//
// All four callbacks share a single user_data pointer (a SignalingHandle).
// Recv/send wrap cy_awsport_network_*; genmask uses our DRBG; on_msg_recv
// latches the most recent text-frame payload into the handle for
// signaling_wait_for_offer to pick up.

