avnet-iotconnect/avnet-iotc-mtb-psoc-edge-aivision-webrtc/proj_cm33_ns/webrtc/algorithm/signaling.c
static ssize_t wslay_recv_cb(wslay_event_context_ptr ctx, uint8_t *buf, size_t len,
                             int flags, void *user_data) {
    (void) flags;
    SignalingHandle sig = (SignalingHandle) user_data;
    int32_t n = cy_awsport_network_receive(&sig->net_ctx, buf, len);
    if (n < 0) {
        sig->transport_error = true;
        wslay_event_set_error(ctx, WSLAY_ERR_CALLBACK_FAILURE);
        printf("[sig] sock recv error n=%d\n", (int) n);
        return -1;
    }
    if (0 == n) {
        wslay_event_set_error(ctx, WSLAY_ERR_WOULDBLOCK);
        return -1;
    }
    return (ssize_t) n;
}

static ssize_t wslay_send_cb(wslay_event_context_ptr ctx, const uint8_t *data, size_t len,
                             int flags, void *user_data) {
    (void) flags;
    SignalingHandle sig = (SignalingHandle) user_data;
    int32_t n = cy_awsport_network_send(&sig->net_ctx, data, len);
    if (n < 0) {
        sig->transport_error = true;
        wslay_event_set_error(ctx, WSLAY_ERR_CALLBACK_FAILURE);
        printf("[sig] sock send error n=%d\n", (int) n);
        return -1;
    }
    if (0 == n) {
        wslay_event_set_error(ctx, WSLAY_ERR_WOULDBLOCK);
        return -1;
    }
    return (ssize_t) n;
}

static int wslay_genmask_cb(wslay_event_context_ptr ctx, uint8_t *buf, size_t len,
                            void *user_data) {
    (void) ctx;
    (void) user_data;
    if (0 != webrtc_csprng_bytes(buf, len)) {
        return -1;
    }
    return 0;
}

// Dispatch a single inbound text frame. Called from on_msg_recv, possibly
// multiple times per wslay_event_recv() call when KVS bursts frames. If the
// envelope is an SDP_OFFER, decode it into a freshly malloc'd buffer and
// install it as sig->pending_offer_sdp (replacing any prior unread offer).
// Anything else is dispatched (ICE_CANDIDATE) or logged and dropped.
static void dispatch_text_frame(SignalingHandle sig, const uint8_t *msg, size_t msg_len) {
    if (0 == msg_len) {
        return;
    }
    WssRecvMessage_t recv = { 0 };
    SignalingResult_t sig_rc = Signaling_ParseWssRecvMessage((const char *) msg, msg_len, &recv);
    if (SIGNALING_RESULT_OK != sig_rc) {
        printf("[sig] parse fail rc=%d len=%u\n", (int) sig_rc, (unsigned) msg_len);
        return;
    }

    // Per-frame decoded type. SignalingTypeMessage_t: 0=UNKNOWN, 1=SDP_OFFER,
    // 2=SDP_ANSWER, 3=ICE_CANDIDATE, 4=GO_AWAY, 5=RECONNECT_ICE_SERVER,
    // 6=STATUS_RESPONSE.
    // printf("[sig]   type=%d sender=%.*s\n",
    //        (int) recv.messageType,
    //        (int) recv.senderClientIdLength, recv.pSenderClientId ? recv.pSenderClientId : "");

    if (SIGNALING_TYPE_MESSAGE_ICE_CANDIDATE == recv.messageType) {
        // D4b: decode base64 payload + JSON-parse + feed to ICE controller.
        // Inbound ICE_CANDIDATE JSON shape mirrors what we send out:
        //   {"candidate":"<sdp body>","sdpMid":"0","sdpMLineIndex":0,
        //    "usernameFragment":"…"}
        // Payloads are small (Chrome's typical candidate is ~150-250 B
        // base64, ~110-180 B decoded). 512 B stack scratch is comfortable.
        if (NULL == recv.pBase64EncodedPayload || 0 == recv.base64EncodedPayloadLength) {
            return;
        }
        uint8_t payload[512];
        size_t decoded_len = 0;
        int b64_rc = mbedtls_base64_decode(
            payload, sizeof(payload), &decoded_len,
            (const unsigned char *) recv.pBase64EncodedPayload,
            recv.base64EncodedPayloadLength);
        if (0 != b64_rc) {
            printf("[signaling] ICE_CANDIDATE base64 decode failed: -0x%04x (len=%u)\n",
                   -b64_rc, (unsigned) recv.base64EncodedPayloadLength);
            return;
        }
        if (NULL == sig->peer_connection_session) {
            printf("[signaling] ICE_CANDIDATE arrived before peer session attach, dropping\n");
            return;
        }

        PeerConnectionResult_t pc_rc = PeerConnection_AddRemoteCandidate(
            sig->peer_connection_session,
            (const char *) payload,
            decoded_len
        );
        if (
            PEER_CONNECTION_RESULT_OK != pc_rc &&
            PEER_CONNECTION_RESULT_FAIL_ICE_CONTROLLER_DESERIALIZE_CANDIDATE != pc_rc
        ) {
            printf("[signaling] PeerConnection_AddRemoteCandidate failed: %d\n", (int) pc_rc);
        }
        return;
    }

    if (SIGNALING_TYPE_MESSAGE_SDP_OFFER != recv.messageType) {
        // GO_AWAY / RECONNECT_ICE_SERVER / STATUS_RESPONSE land later.
        return;
    }

    if (NULL == recv.pBase64EncodedPayload || 0 == recv.base64EncodedPayloadLength) {
        printf("[signaling] SDP_OFFER missing messagePayload\n");
        return;
    }

    // Decode into a freshly malloc'd buffer sized to the base64 payload. mbedtls
    // gives back at most (b64_len * 3 / 4) bytes, and the JSON-unescape pass
    // only shrinks the result, so this cap is safe.
    size_t scratch_cap = (recv.base64EncodedPayloadLength * 3U) / 4U + 4U;
    char *scratch = malloc(scratch_cap);
    if (NULL == scratch) {
        printf("[signaling] OOM allocating SDP_OFFER scratch (%u bytes)\n", (unsigned) scratch_cap);
        return;
    }

    size_t decoded_len = 0;
    int b64_rc = mbedtls_base64_decode(
        (unsigned char *) scratch, scratch_cap - 1, &decoded_len,
        (const unsigned char *) recv.pBase64EncodedPayload,
        recv.base64EncodedPayloadLength
    );
    if (0 != b64_rc) {
        printf("[signaling] base64 decode of SDP_OFFER payload failed: -0x%04x\n", -b64_rc);
        free(scratch);
        return;
    }
    scratch[decoded_len] = '\0';

    // The base64-decoded payload is a JSON envelope: {"type":"offer","sdp":"<sdp>"}.
    // Chrome / KVS escapes \r and \n inside the SDP as the two-byte literal
    // sequences \r and \n. Unwrap + un-escape in place so callers see real
    // SDP with real CR/LF.
    char *p = strstr(scratch, "\"sdp\":\"");
    if (NULL == p) {
        printf("[signaling] SDP_OFFER envelope missing \"sdp\" key\n");
        free(scratch);
        return;
    }
    p += 7;     // past `"sdp":"`
    char *dst = scratch;
    const char *src = p;
    const char *end = scratch + decoded_len;
    bool closed = false;
    while (src < end) {
        char c = *src++;
        if ('\\' == c && src < end) {
            char esc = *src++;
            switch (esc) {
                case 'r':  *dst++ = '\r'; break;
                case 'n':  *dst++ = '\n'; break;
                case 't':  *dst++ = '\t'; break;
                case '"':  *dst++ = '"';  break;
                case '\\': *dst++ = '\\'; break;
                case '/':  *dst++ = '/';  break;
                default:
                    // Unknown escape — keep literal so we can spot it in logs.
                    *dst++ = '\\';
                    *dst++ = esc;
                    break;
            }
        } else if ('"' == c) {
            // Closing quote of the "sdp" value.
            closed = true;
            break;
        } else {
            *dst++ = c;
        }
    }
    if (!closed) {
        printf("[signaling] SDP_OFFER envelope: unterminated \"sdp\" string\n");
        free(scratch);
        return;
    }
    size_t sdp_len = (size_t)(dst - scratch);
    scratch[sdp_len] = '\0';

    // Latch sender client id last, only after the offer payload is known good,
    // so a malformed offer doesn't corrupt the routing for the next valid one.
    if (recv.senderClientIdLength >= sizeof(sig->peer_client_id)) {
        printf("[signaling] senderClientId too long (%u >= %u)\n",
               (unsigned) recv.senderClientIdLength, (unsigned) sizeof(sig->peer_client_id));
        free(scratch);
        return;
    }

