avnet-iotconnect/avnet-iotc-mtb-psoc-edge-aivision-webrtc/proj_cm33_ns/webrtc/algorithm/signaling.c
    if (NULL != sig->ws_ctx) {
        wslay_event_context_free(sig->ws_ctx);
        sig->ws_ctx = NULL;
    }
    // Drain any envelopes that producers queued after the transport went
    // away — wslay is gone, nothing left to send. Free the buffers so they
    // don't leak across the next session.
    if (NULL != sig->outbox_queue) {
        SignalingOutboxItem_t drop;
        while (pdTRUE == xQueueReceive(sig->outbox_queue, &drop, 0)) {
            free(drop.envelope);
        }
    }
    if (NULL != sig->pending_offer_sdp) {
        free(sig->pending_offer_sdp);
        sig->pending_offer_sdp = NULL;
    }
    sig->pending_offer_len = 0;
    sig->peer_connection_session = NULL;
    cy_awsport_network_disconnect(&sig->net_ctx);
    cy_awsport_network_delete(&sig->net_ctx);
    sig->connected = false;

    signaling_unlock(sig);
}

// -------------------------------------------------------------------------
// Step 5b Increment C — JSON envelope wrap/unwrap (messageType / messagePayload)
// -------------------------------------------------------------------------
//
// Receive shape (KVS docs, lowercase keys):
//   { "senderClientId":"<uuid>", "messageType":"SDP_OFFER",
//     "messagePayload":"<base64-encoded SDP>" }
//
// Send shape (KVS docs, mixed-case keys with "action"):
//   { "action":"SDP_ANSWER", "RecipientClientId":"<uuid>",
//     "MessagePayload":"<base64-encoded SDP>" }
//
// The upstream signaling lib (Signaling_ParseWssRecvMessage /
// Signaling_ConstructWssMessage) handles the JSON shape on both sides; we
// own the base64 step on either side and the wslay queue/drive on send.

// Drive the wslay event loop until dispatch_text_frame parks a pending SDP
// offer, the peer closes, or the socket dies. On success returns 0 with
// out_sdp populated (copied out of the internal pending slot, which is then
// freed) and senderClientId latched on the handle.
//
// No wall-clock budget — we're MASTER and may idle indefinitely waiting for
// a viewer (browser) to publish. The recv callback's per-call socket timeout
// (WSS_SOCK_RECV_TIMEOUT_MS) keeps the loop cooperative. Caller's stop
// signal is not observed here; the loop exits when the websocket closes
// (network event or peer hangup → transport_error) or when an offer arrives.
//
// Re-entrant across viewer sessions: between calls, dispatch_text_frame may
// still capture offers into the pending slot (e.g. a STOP/START on the
// browser side mid-teardown), and the next wait_for_offer returns it
// immediately.
int signaling_wait_for_offer(SignalingHandle sig, char *out_sdp, size_t out_sdp_cap, size_t *out_sdp_len) {
    if (NULL == sig || NULL == out_sdp || out_sdp_cap < 2 || NULL == out_sdp_len
        || !sig->connected || NULL == sig->ws_ctx) {
        return -1;
    }
    *out_sdp_len = 0;

    int rc;
    for (;;) {
        bool transport_error;
        bool peer_closed;
        char *consumed = NULL;
        size_t consumed_len = 0;

        if (0 != signaling_lock(sig, pdMS_TO_TICKS(SIG_WS_MUTEX_TIMEOUT_MS))) {
            rc = -1;
            goto out;
        }

        if (!sig->connected || NULL == sig->ws_ctx) {
            signaling_unlock(sig);
            rc = -1;
            goto out;
        }

        // Consume any offer parked by dispatch_text_frame before draining I/O,
        // so an offer that arrived between viewer sessions returns immediately.
        if (NULL != sig->pending_offer_sdp) {
            consumed = sig->pending_offer_sdp;
            consumed_len = sig->pending_offer_len;
            sig->pending_offer_sdp = NULL;
            sig->pending_offer_len = 0;
        }

        int recv_err = 0;
        if (NULL == consumed) {
            maybe_queue_keepalive_ping_locked(sig);
            drain_outbox_locked(sig);
            // Send any queued frames first (close, pong, future messages).
            if (wslay_event_want_write(sig->ws_ctx)) {
                int wrc = wslay_event_send(sig->ws_ctx);
                if (0 != wrc) {
                    printf("[sig] wslay_event_send rc=%d\n", wrc);
                    signaling_unlock(sig);
                    rc = -1;
                    goto out;
                }
            }

            if (wslay_event_want_read(sig->ws_ctx)) {
                recv_err = wslay_event_recv(sig->ws_ctx);
            }

            // dispatch_text_frame fires synchronously inside wslay_event_recv
            // and may have just installed a pending offer — pick it up here.
            if (NULL != sig->pending_offer_sdp) {
                consumed = sig->pending_offer_sdp;
                consumed_len = sig->pending_offer_len;
                sig->pending_offer_sdp = NULL;
                sig->pending_offer_len = 0;
            }
        }

        transport_error = sig->transport_error;
        peer_closed = !wslay_event_want_read(sig->ws_ctx) && !wslay_event_want_write(sig->ws_ctx);
        signaling_unlock(sig);

        // Transport-dead check runs *regardless* of whether we captured an
        // offer this iteration. A pending offer parked by the same recv that
        // also reported -1 (typical KVS idle-timeout pattern: server delivers
        // the offer, FINs the socket) is useless — every subsequent
        // send_answer / trickle ICE would fail. Drop it and let the outer
        // loop rebuild the WSS; the browser will re-publish on reconnect.
        if (0 != recv_err || transport_error || peer_closed) {
            if (NULL != consumed) {
                printf("[sig] dropping captured offer (%u bytes), transport dead: recv_err=%d transport_err=%d peer_closed=%d\n",
                       (unsigned) consumed_len, recv_err, (int) transport_error, (int) peer_closed);
                free(consumed);
                consumed = NULL;
            } else if (0 != recv_err) {
                printf("[sig] wslay_event_recv rc=%d transport_err=%d\n",
                       recv_err, (int) transport_error);
            } else if (peer_closed) {
                printf("[sig] peer close, read+write both disabled\n");
            }
            rc = -1;
            goto out;
        }

